# SpotDimensionFormerSetMoribundCall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotDimensionFormerSetMoribundCall Property
BuiltInFailures..::..DimensionFailures Class See Also
---
One or more Spot Dimension references are no longer valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotDimensionFormerSetMoribundCall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotDimensionFormerSetMoribundCall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotDimensionFormerSetMoribundCall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace